---
kind: property
id: P:Autodesk.Revit.DB.CurveArray.Size
source: html/4740fa03-7869-5618-8a10-286787f4703b.htm
---
# Autodesk.Revit.DB.CurveArray.Size Property

Returns the number of curves that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```